Autodesk.Revit.DB.TransientGRepKeeper.AddToGRepKeeperForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.TransientGRepKeeper.SetGRepKeeperForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL